In [1]:
!python -V

Python 3.10.5

In [2]:
import sqlite3
import pandas as pd
pd.__version__

'2.0.2'

In [3]:
sqlite_connection = sqlite3.connect('test.db')

In [4]:
pd.read_sql("""SELECT * FROM category;""", sqlite_connection).sample(5)

   category_id  parent_category_id              name
4            5                 2.0      Фотоаппараты
6            7                 2.0      Аудиотехника
1            2                 NaN  Цифровая техника
0            1                 NaN   Товары для дома
2            3                 1.0   Бытовая техника

In [47]:
#solution using pandas
df = pd.read_sql(
    """SELECT 
        employee_id,
        first_name,
        last_name,
        coalesce(manager_id, 0) manager_id  
    FROM employee e;""", \
    sqlite_connection)

In [48]:
df['count_managers'] = 0

for i in range(len(df)):
    j = i
    while df.iloc[j]['manager_id'] > 0:
        df.at[i, 'count_managers'] += 1
        j = df.iloc[j]['manager_id']
        
df.drop(columns=['manager_id'], inplace=True)
df.sample(10)

    employee_id first_name    last_name  count_managers
32           33      Лилия    Леонтьева               2
39           44     Эдуард        Рогов               2
0             1    Алексей       Иванов               0
10           11       Глеб      Тарасов               0
18           19    Зиновий    Белозёров               1
44           49     Виктор     Медведев               2
34           35   Терентий        Буров               2
35           40       Нина  Кондратьева               2
7             8       Петр     Корсаков               0
11           12  Владислав   Калашников               0

In [ ]:
# solution using sql
df = pd.read_sql(
    """SELECT 
        employee_id,
        first_name,
        last_name,
        coalesce(manager_id, 0) manager_id  
    FROM employee e;""", \
    sqlite_connection)

# WITH RECURSIVE temp (employee_id, manager_id, c) AS 
# (SELECT 0, manager_id, 0 FROM employee
#   UNION ALL 
#  SELECT 0, manager_id, 0 FROM temp -- Рекурсивный подзапрос 
#         WHERE manager_id > c)
# SELECT * FROM temp;